gettobyte/GB_AutoBoardV1_MCAL_Codes/Peripherals/CAN/G2B_CAN_S32K344/src/Example2_Rx_CAN_HSE.c
	    FlexCAN_Ip_Init(INST_FLEXCAN_4, &FlexCAN_State0, &FlexCAN_Config0);

	    FlexCAN_Api_Status = FlexCAN_Ip_SetStartMode(INST_FLEXCAN_4);


	    Lpspi_Ip_Init(&Lpspi_Ip_PhyUnitConfig_SpiPhyUnit_0_Instance_3);
	  	GB_ST7789_Init();

	  	TestDelay(700000);
	  	ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
	  	ST7789_Fill_Color(ST77XX_BLACK);
	  	TestDelay(700000);


	    ST7789_WriteString(0, 80, "VCU ECU: Slave Node", Font_16x26, ST77XX_NEON_GREEN, ST77XX_BLACK);




	    /************** Digital Signature/Verification Process**************/

//    	hseKeyHandle_t digital_signature_keyPairHandle = GET_KEY_HANDLE(HSE_KEY_CATALOG_ID_NVM,4,2);
//    	/*Key Handle for Public Key in RAM catalog*/
    	hseKeyHandle_t digital_signature_keyPubHandle = GET_KEY_HANDLE(HSE_KEY_CATALOG_ID_RAM,7,4);

    	 ST7789_WriteString(0, 80, "Waiting for ECC pub key to receive for Digital Signature for authentication .... ", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);

    	 FlexCAN_Api_Status = FlexCAN_Ip_ConfigRxMb(INST_FLEXCAN_4, Rx_DS_Pub_key_MB_IDX, &rx_info_polling_std, Rx_DS_Pub_key_MSG_IDX);
    	 while(FLEXCAN_STATUS_TIMEOUT == FlexCAN_Ip_ReceiveBlocking(INST_FLEXCAN_4, Rx_DS_Pub_key_MB_IDX, &rxData_DS_Pub_Keys, true,1000));

    	 ST7789_WriteString(0, 80, "Received ECC pub key's for Digital Signature for authentication .... ", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);
    	 scaleImage(rxData_DS_Pub_Keys.data, ScaledImage2);
    	 ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
    	 ST7789_DrawImage(30,250, 120, 120, ScaledImage2);

    	 HseResponse = LoadEccPublicKey(&digital_signature_keyPubHandle,0,HSE_EC_SEC_SECP256R1,256,rxData_DS_Pub_Keys.data);
    		    ASSERT(HSE_SRV_RSP_OK == HseResponse);


    	 ST7789_WriteString(0, 80, "Waiting for digital signature's to receive for Digital Signature for authentication .... ", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);

    	 FlexCAN_Api_Status = FlexCAN_Ip_ConfigRxMb(INST_FLEXCAN_4, Rx_DS_SignS_MB_IDX, &rx_info_polling_std, Rx_DS_SignS_key_MSG_IDX);
    	 while(FLEXCAN_STATUS_TIMEOUT == FlexCAN_Ip_ReceiveBlocking(INST_FLEXCAN_4, Rx_DS_SignS_MB_IDX, &rxData_DS_SignS_Keys, true,1000));

    	 FlexCAN_Api_Status = FlexCAN_Ip_ConfigRxMb(INST_FLEXCAN_4, Rx_DS_SignR_MB_IDX, &rx_info_polling_std, Rx_DS_SignR_key_MSG_IDX);
    	 while(FLEXCAN_STATUS_TIMEOUT == FlexCAN_Ip_ReceiveBlocking(INST_FLEXCAN_4, Rx_DS_SignR_MB_IDX, &rxData_DS_SignR_Keys, true,1000));

    	 for( int i =0; i<32; i++)
    	 {
    		 SignR_Digital_Signature [i] = rxData_DS_SignR_Keys[i];
    		 SignS_Digital_Signature [i] = rxData_DS_SignS_Keys[i];
    		 Sign_length = i+1;
    	 }

    	 ST7789_WriteString(0, 80, "Received Signature for authentication .... ", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);
    	 scaleImage(SignR_Digital_Signature, ScaledImage3);
    	 ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
    	 ST7789_DrawImage(30,250, 120, 120, ScaledImage3);


    	 ST7789_WriteString(0, 80, "Verifing the digital signature .... ", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);

 	    HseResponse = EcdsaVerify(digital_signature_keyPubHandle,HSE_HASH_ALGO_SHA2_256,sizeof(msg),msg,FALSE,0,&Sign_length, SignR_Digital_Signature, &Sign_length, SignS_Digital_Signature);
 	    ASSERT(HSE_SRV_RSP_OK == HseResponse);




	//For Session Keys example
    hseKeyHandle_t eccRAMKeyHandle = HSE_DEMO_RAM_ECC_PAIR_KEY_HANDLE;
	//hseKeyHandle_t eccRAMKeyHandle = HSE_DEMO_RAM_ECC_PUB_KEY_HANDLE;
    hseKeyHandle_t DHSharedSecretRAMKeyHandle = HSE_DEMO_DH_SHARED_SECRET_HANDLE;
   // hseKeyHandle_t AESDerivedKeyInfoHandle1 = HSE_DEMO_RAM_AES256_KEY1;
    hseKeyHandle_t AESDerivedKeyInfoHandle1 = HSE_DEMO_NVM_AES256_KEY2;

    ST7789_WriteString(10, 130, "Exchanging keys for secure communication(via ECDH)....", Font_11x18, ST77XX_NEON_GREEN, ST77XX_BLACK);

  	TestDelay(14000000);



    /********* Key Exchange protocol ECDH for Shared Secret Key */
    // Key Exchange via ECDH protocol
    //generate the ecc private - public key and export the public key to application
    HseResponse = GenerateEccKeyAndExportPublic( eccRAMKeyHandle, HSE_EC_SEC_SECP256R1, HSE_KF_USAGE_EXCHANGE, ECC_Public_key);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);

    // transmit the exported public key to the other node via can and also receive the exported public key of other node and use that in next step to import it in public key handle

    ST7789_WriteString(0, 190, "Slave Node Receiving Public keys for computing shared key.....", Font_11x18, ST77XX_RED, ST77XX_BLACK);

    FlexCAN_Api_Status = FlexCAN_Ip_ConfigRxMb(INST_FLEXCAN_4, RX_MB_IDX, &rx_info_polling_std, ECDH_Tx_Pub_Key_MSG_ID);
    while(FLEXCAN_STATUS_TIMEOUT == FlexCAN_Ip_ReceiveBlocking(INST_FLEXCAN_4, RX_MB_IDX, &rxData, true,1000));

    scaleImage(rxData.data, ScaledImage);
	ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
	ST7789_DrawImage(30,250, 120, 120, ScaledImage);

  	TestDelay(14000000);

    ST7789_WriteString(0, 190, "Slave Node has received public keys for computing shared key.....", Font_11x18, ST77XX_ORANGE, ST77XX_BLACK);
  	TestDelay(35000000);

//    string1 = uint8_to_stringhex(rxData.data, rxData.dataLen );
//	ST7789_WriteString(0, 160, string1 , Font_7x10, ST77XX_NEON_GREEN, ST77XX_BLACK);

  	ST7789_SetAddressWindow(30,250, ST7789_XEnd, ST7789_YEnd);
    ST7789_Fill_Color(ST77XX_BLACK);

    ST7789_WriteString(0, 190, "Slave Node Sending Public keys for computing shared key....", Font_11x18, ST77XX_BLUE, ST77XX_BLACK);

  	TestDelay(14000000);
    scaleImage(ECC_Public_key, ScaledImage);
  	ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
  	ST7789_DrawImage(30,250, 120, 120, ScaledImage);


    FlexCAN_Api_Status = FlexCAN_Ip_Send(INST_FLEXCAN_4, TX_MB_IDX, &rx_info_inter_canfd, ECDH_Rx_Pub_Key_MSG_ID, (uint8 *)&ECC_Public_key);
  	TestDelay(14000000);

    ST7789_WriteString(0, 190, "Slave Node has Sended Public keys for computing shared key....", Font_11x18, ST77XX_CYAN, ST77XX_BLACK);
  	TestDelay(35000000);

    ST7789_SetAddressWindow(30,250, ST7789_XEnd, ST7789_YEnd);
    ST7789_Fill_Color(ST77XX_BLACK);

    ST7789_WriteString(0, 190, "Now Computing shared secret key via ECDH protocol for S32K3 HSE", Font_11x18, ST77XX_MAGENTA, ST77XX_BLACK);

  	TestDelay(35000000);


    /* Import ECC Key */
    // import the received public key from other node to the ecc key pair handle
    HseResponse = ImportEccKeyReq(HSE_DEMO_RAM_ECC_PUB_KEY_HANDLE, HSE_KEY_TYPE_ECC_PUB,HSE_KF_USAGE_EXCHANGE | HSE_KF_ACCESS_EXPORTABLE, HSE_EC_SEC_SECP256R1, KeyBitLen(HSE_EC_SEC_SECP256R1), rxData.data, NULL);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);

    // now compute the shared secret from the public( having new public key from other node) and private key handles
    /* Compute DH Shared Secret (ECDH) */
    HseResponse = DHSharedSecretCompute(HSE_DEMO_RAM_ECC_PUB_KEY_HANDLE,HSE_DEMO_RAM_ECC_PAIR_KEY_HANDLE,&DHSharedSecretRAMKeyHandle,RAM_KEY,KeyBitLen(HSE_EC_SEC_SECP256R1));
    ASSERT(HSE_SRV_RSP_OK == HseResponse);




  /***** Derive Key using SP800_108 KDF for AES Key*********/


    HKF_AllocKeySlot(RAM_KEY, HSE_KEY_TYPE_SHARED_SECRET, KdfSP800_108_Scheme_1_0.kdfCommon.keyMatLen * 8U, &targetSharedSecretKey_1);

       KdfSP800_108_Scheme_1_0.kdfCommon.srcKeyHandle = DHSharedSecretRAMKeyHandle ;
       KdfSP800_108_Scheme_1_0.kdfCommon.targetKeyHandle = targetSharedSecretKey_1;


