gettobyte/GB_AutoBoardV1_MCAL_Codes/Peripherals/CAN/G2B_CAN_S32K344/src/Example2_Rx_CAN_HSE.c
       HseResponse =  HSEKdfSP800_108Req(&KdfSP800_108_Scheme_1_0);



    //HSEKdfSP800
//    HseResponse = KdfSP800_108ReqTest_demo();

    //Declare the information about the 256 bits AES key to be extracted
    hseKeyInfo_t aes256KeyInfo = {
        .keyType = HSE_KEY_TYPE_AES,                             //Will generate an AES key
        .keyFlags = (HSE_KF_USAGE_ENCRYPT |HSE_KF_USAGE_DECRYPT| //Usage flags for this key - Encrypt/Decrypt/Sign/Verify - AEAD
            HSE_KF_USAGE_SIGN|HSE_KF_USAGE_VERIFY | HSE_KF_ACCESS_EXPORTABLE),
        .keyBitLen = 256U,                                       //256 bits key
    };

    //Extract the 256 bits AES key from the remaining derived key material
    HseResponse = HSEKeyDeriveExtractKeyReq
            (
                   KdfSP800_108_Scheme_1_0.kdfCommon.targetKeyHandle,
            	//	DHSharedSecretRAMKeyHandle,
            		BITS_TO_BYTES(aes256KeyInfo.keyBitLen),
                    &AESDerivedKeyInfoHandle1,
					//NVM_KEY,
					 RAM_KEY,
                    aes256KeyInfo
            );
    ASSERT(HSE_SRV_RSP_OK == HseResponse);


    HseResponse = AesEncrypt(AESDerivedKeyInfoHandle1, HSE_CIPHER_BLOCK_MODE_ECB, NULL, PlaintextLength, Plaintext, aes_exported, HSE_SGT_OPTION_NONE);
        	ASSERT(HSE_SRV_RSP_OK == HseResponse);

        	scaleImage(aes_exported, ScaledImage);
            ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
            ST7789_DrawImage(30,250, 120, 120, ScaledImage);


    HseResponse = ExportPlainSymKeyReq(AESDerivedKeyInfoHandle1,&aes256KeyInfo, aes_exported, &aes_exported_len  );



    /****** MAC Generation and Verification ****************/

//    //CMAC Generation using CMAC_Plaintext and AESDerivedKeyInfoHandle1 key handle( which is derived from KDF function).
//    hseMacScheme_t macScheme;
//    macScheme.macAlgo = HSE_MAC_ALGO_CMAC;
//    macScheme.sch.cmac.cipherAlgo = HSE_CIPHER_ALGO_AES;
//    HseResponse = AesCmacGenerate(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext), CMAC_Plaintext, &CMAC_Tag_length,  CMAC_Tag_OutPut, HSE_SGT_OPTION_NONE );
//  		  //MacSignSrv(HSE_ACCESS_MODE_ONE_PASS, 0, macScheme, AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext), CMAC_Plaintext, &CMAC_Tag_length,  CMAC_Tag_OutPut, HSE_SGT_OPTION_NONE );
//
//    // Master will transmit the CMAC_PlainText & CMAC_Tag_OutPut to receiver and also AES Derived Key value to receiver.
//    // Receiver will received the derived key handle and will import that into it for AES key handle in NVM.
//
//
    ST7789_WriteString(0, 190, "Receiving Data ", Font_11x18, ST77XX_CYAN, ST77XX_BLACK);


    FlexCAN_Api_Status = FlexCAN_Ip_ConfigRxMb(INST_FLEXCAN_4, RX_MB_IDX2, &rx_info_polling_std, Message_Rx_MSG_ID);
     while(FLEXCAN_STATUS_TIMEOUT == FlexCAN_Ip_ReceiveBlocking(INST_FLEXCAN_4, RX_MB_IDX2, &rxData, true,1000));

     scaleImage(rxData.data, ScaledImage);
 	ST7789_SetAddressWindow(ST7789_XStart,ST7789_YStart, ST7789_XEnd, ST7789_YEnd);
 	ST7789_DrawImage(30,250, 120, 120, ScaledImage);

 	for ( int i =0; i<16; i++)
 	{
 		Tag_of_message_received[i] = rxData.data[i];
 	}
 	ST7789_WriteString(0, 190, "Verifying Data ", Font_11x18, ST77XX_CYAN, ST77XX_BLACK);


   HseResponse = AesCmacVerify(AESDerivedKeyInfoHandle1, nxp_logo_length, nxp_logo, &CMAC_Tag_length,  Tag_of_message_received, HSE_SGT_OPTION_NONE );
//
//
//   /********* CMAC With Counter Demo Code ********************/
//
//   uint32_t volatileCnt       = 0xFFFFFFFFUL;
//
//    uint32_t rpBitSize          = 40UL;
//    uint32_t TxnodecntIdx       = HSE_NUM_OF_MONOTONIC_COUNTERS - 3UL;
//    uint32_t RxnodecntIdx       = HSE_NUM_OF_MONOTONIC_COUNTERS - 2UL;
//
//    HseResponse =  MonotonicCnt_Config(TxnodecntIdx,rpBitSize);
//    ASSERT(HSE_SRV_RSP_OK == HseResponse);
//
//    /* Configure Node B */
//    HseResponse = MonotonicCnt_Config(RxnodecntIdx, rpBitSize);
//    ASSERT(HSE_SRV_RSP_OK == HseResponse);
//
//
//    /* Configure Node A Counter as a default value */
//    HseResponse = MonotonicCnt_Increment(TxnodecntIdx, 0x800000UL);
//      ASSERT(HSE_SRV_RSP_OK == HseResponse);
//
//      /* Configure Node B Counter as a default value */
//      HseResponse = MonotonicCnt_Increment(RxnodecntIdx, 0x800000UL);
//      ASSERT(HSE_SRV_RSP_OK == HseResponse);
//
//
//    HseResponse = CmacWithCounter(AESDerivedKeyInfoHandle1, HSE_AUTH_DIR_GENERATE,TxnodecntIdx, 0,
//    		NUM_OF_ELEMS(CMAC_Plaintext)*8U, CMAC_Plaintext, (16*8), CMAC_Tag_OutPut, &volatileCnt, HSE_SGT_OPTION_NONE);
//
//
//    HseResponse = CmacWithCounter(AESDerivedKeyInfoHandle1, HSE_AUTH_DIR_VERIFY,RxnodecntIdx, 0,
//    		NUM_OF_ELEMS(CMAC_Plaintext)*8U, CMAC_Plaintext, (16*8), CMAC_Tag_OutPut, &volatileCnt, HSE_SGT_OPTION_NONE);
//
//
//



    /***************Fast CMAC ***************************/

    HseResponse = AesFastCmacGenerate(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext)*8, CMAC_Plaintext, Fast_CMAC_Tag_length*8, Fast_CMAC_Tag_OutPut);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);


    //Sender will send, plaintext, aesderivekey info and
    HseResponse = AesFastCmacVerify(AESDerivedKeyInfoHandle1, NUM_OF_ELEMS(CMAC_Plaintext)*8, CMAC_Plaintext, Fast_CMAC_Tag_length*8, Fast_CMAC_Tag_OutPut);
    ASSERT(HSE_SRV_RSP_OK == HseResponse);



    uint8_t ciphermsg[NUM_OF_ELEMS(demoapp_msg)] = {0U};



    /* Finished session keys related example */
    for (;;) {

    }

    return 0;
}


hseKeyHandle_t srcKey_0 = HSE_INVALID_KEY_HANDLE;
hseKeyHandle_t targetSharedSecretKey_0 = HSE_INVALID_KEY_HANDLE;

hseSrvResponse_t KdfSP800_108ReqTest_demo()
{
    hseSrvResponse_t hseResponse;

    HKF_AllocKeySlot(RAM_KEY, KdfSP800_108_ImportSecret_1_0.pKey->pKeyInfo->keyType,
                     KdfSP800_108_ImportSecret_1_0.pKey->pKeyInfo->keyBitLen, &srcKey_0);

    HKF_AllocKeySlot(RAM_KEY, HSE_KEY_TYPE_SHARED_SECRET, KdfSP800_108_Scheme_1_0.kdfCommon.keyMatLen * 8U, &targetSharedSecretKey_0);

    KdfSP800_108_ImportSecret_1_0.pKey->keyHandle = srcKey_0;
    KdfSP800_108_Scheme_1_0.kdfCommon.srcKeyHandle = srcKey_0;
    KdfSP800_108_Scheme_1_0.kdfCommon.targetKeyHandle = targetSharedSecretKey_0;
    hseResponse = KdfSP800_108Test_0(&KdfSP800_108_ImportSecret_1_0, &KdfSP800_108_Scheme_1_0);
    goto exit;
    exit:
    return hseResponse;
}


static hseSrvResponse_t KdfSP800_108Test_0
(hseKeyImportParams_t *pImportSecretParams, hseKdfSP800_108Scheme_t *pKdfScheme)
{
    hseSrvResponse_t hseResponse;

    pImportSecretParams->authParams.pKeyHandle = NULL;
    pImportSecretParams->cipherParams.pKeyHandle = NULL;
    hseResponse = ImportKeyReq(pImportSecretParams);
    if(HSE_SRV_RSP_OK != hseResponse)
    {
        goto exit;
    }

    hseResponse = HSEKdfSP800_108Req(pKdfScheme);
    if(HSE_SRV_RSP_OK != hseResponse)
    {
        goto exit;
    }
    exit:
    return hseResponse;
}
